** Creating Stored Procedures

As already explained, writing a stored procedure is not trivial. To give you a taste for what is involved, let's look at a simple example---a stored procedure that counts the number of customers in a mailing list who have e-mail addresses.

#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
CREATE PROCEDURE MailingListCount(OUT ListCount INTEGER )
BEGIN

declare v_rows INTEGER;

SELECT COUNT(*) INTO v_rows
FROM Customers
WHERE NOT cust_email IS NULL;

SET ListCount := v_rows;

END;
#+END_SRC

#+RESULTS:
|   |

This stored procedure takes a single parameter named ListCount. Instead of passing a value to the stored procedure, this parameter passes a value back from it. The keyword OUT is used to specify this behavior. Oracle supports parameters of types IN (those passed to stored procedures), OUT (those passed from stored procedures, as we've used here), and INOUT (those used to pass parameters to and from stored procedures). The stored procedure code itself is enclosed within BEGIN and END statements, and here a simple SELECT is performed to retrieve the customers with e-mail addresses. Then ListCount (the output parameter passed) is set with the number of rows that were retrieved.

To invoke the Oracle example you could do the following:

#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
    var ReturnValue NUMBER
    EXEC MailingListCount(:ReturnValue);
    SELECT ReturnValue;
#+END_SRC

#+RESULTS:
|   |

This code declares a variable to hold whatever the stored procedure returns, executes the store procedure, and then uses a SELECT to display the returned value.

Here's the Microsoft SQL Server version:

#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
    CREATE PROCEDURE MailingListCount
    AS
    DECLARE @cnt INTEGER
    SELECT @cnt = COUNT(*)
    FROM Customers
    WHERE NOT cust_email IS NULL; RETURN @cnt;
#+END_SRC

#+RESULTS:
|   |

This stored procedure takes no parameters at all. The calling application retrieves the value by using SQL Server's return code support. Here a local variable named @cnt is declared using the DECLARE statement (all local variables in SQL Server are named starting with a @). This variable is then used in the SELECT statement so that it contains the value returned by the COUNT() function. Finally, the RETURN statement is used to return the count to the calling application as RETURN @cnt.

To invoke the SQL Server example you could do the following:

#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
    DECLARE @ReturnValue INT
    EXECUTE @ReturnValue=MailingListCount;
    SELECT @ReturnValue;
#+END_SRC

This code declares a variable to hold whatever the stored procedure returns, executes the store procedure, and then uses a SELECT to display the returned value.

Here's another example, this time to insert a new order in the Orders table. This is a SQL Server--only example, but it demonstrates some useful stored procedure uses and techniques:

#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
    CREATE PROCEDURE NewOrder @cust_id CHAR(10)
    AS
    -- Declare variable for order number
    DECLARE @order_num INTEGER
    -- Get current highest order number
    SELECT @order_num=MAX(order_num) FROM Orders
    -- Determine next order number
    SELECT @order_num=@order_num+1
    -- Insert new order INSERT INTO Orders(order_num, order_date, cust_id)
    VALUES(@order_num, GETDATE(), @cust_id)
    -- Return order number
    RETURN @order_num;
#+END_SRC

This stored procedure creates a new order in the Orders table. It takes a single parameter, the ID of the customer placing the order. The other two table columns, the order number and order date, are generated automatically within the stored procedure itself. The code first declares a local variable to store the order number. Next, the current highest order number is retrieved (using a MAX() function) and incremented (using a SELECT statement). Then the order is inserted with an INSERT statement using the newly generated order number, the current system date (retrieved using the GETDATE() function), and the passed customer ID. Finally, the order number (which is needed to process order items) is returned as RETURN @order_num. Notice that The code is commented---this should always be done when writing stored the procedures.

#+BEGIN_QUOTE
  *Note: Comment Your Code*

  All code should be commented, and stored procedures are no different. Adding comments will not affect performance at all, so there is no downside here (other than the time it takes to write them). The benefits are numerous and include making it easier for others (and yourself) to understand the code and safer to make changes at a later date.

  As noted in Lesson 2, a common way to comment code is to precede it by -- (two hyphens). Some DBMSs support alternate comment syntax, but all support -- and so you are best off using that.
#+END_QUOTE

Here's a quite different version of the same SQL Server code:

#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
    CREATE PROCEDURE NewOrder @cust_id CHAR(10)
    AS
    -- Insert new order
    INSERT INTO Orders(cust_id) VALUES(@cust_id)
    -- Return order number
    SELECT order_num = @@IDENTITY;
#+END_SRC

This stored procedure also creates a new order in the Orders table. This time the DBMS itself generates the order number. Most DBMSs support this type of functionality; SQL Server refers to these auto-incrementing columns as Identity fields (other DBMSs use names such as Auto Number or Sequences). Again, a single parameter is passed: the customer ID of the customer placing the order. The order number and order date are not specified at all---the DBMS uses a default value for the date (the GETDATE() function), and the order number is generated automatically. How can you find out what the generated ID is? SQL Server makes that available in the global variable @@IDENTITY, which is returned to the calling application (this time using a SELECT statement).

As you can see, with stored procedures there are often many different ways to accomplish the same task. The method you choose will often be dictated by the features of the DBMS you are using.

